stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_adc.h
/* Definition of channels sampling time information to be inserted into       */
/* channels literals definition.                                              */
/* Value shifted are equivalent to bitfield "ADC_SMPRx_SMPy" position         */
/* in register.                                                               */
#define ADC_CHANNEL_0_SMP                  (ADC_SMPR1_REGOFFSET | (( 0UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_1_SMP                  (ADC_SMPR1_REGOFFSET | (( 3UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_2_SMP                  (ADC_SMPR1_REGOFFSET | (( 6UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_3_SMP                  (ADC_SMPR1_REGOFFSET | (( 9UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_4_SMP                  (ADC_SMPR1_REGOFFSET | ((12UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_5_SMP                  (ADC_SMPR1_REGOFFSET | ((15UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_6_SMP                  (ADC_SMPR1_REGOFFSET | ((18UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_7_SMP                  (ADC_SMPR1_REGOFFSET | ((21UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_8_SMP                  (ADC_SMPR1_REGOFFSET | ((24UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_9_SMP                  (ADC_SMPR1_REGOFFSET | ((27UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_10_SMP                 (ADC_SMPR2_REGOFFSET | (( 0UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_11_SMP                 (ADC_SMPR2_REGOFFSET | (( 3UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_12_SMP                 (ADC_SMPR2_REGOFFSET | (( 6UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_13_SMP                 (ADC_SMPR2_REGOFFSET | (( 9UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_14_SMP                 (ADC_SMPR2_REGOFFSET | ((12UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_15_SMP                 (ADC_SMPR2_REGOFFSET | ((15UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_16_SMP                 (ADC_SMPR2_REGOFFSET | ((18UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_17_SMP                 (ADC_SMPR2_REGOFFSET | ((21UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))
#define ADC_CHANNEL_18_SMP                 (ADC_SMPR2_REGOFFSET | ((24UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS))

/* Definition of ADC channel look up table containing channels information */
static const uint32_t ADC_CHANNEL_LUT[] =
{
  (ADC_CHANNEL_0_SMP   | ADC_CHANNEL_0_BITFIELD),    /*!< ADC channel ADCx_IN0  */
  (ADC_CHANNEL_1_SMP   | ADC_CHANNEL_1_BITFIELD),    /*!< ADC channel ADCx_IN1  */
  (ADC_CHANNEL_2_SMP   | ADC_CHANNEL_2_BITFIELD),    /*!< ADC channel ADCx_IN2  */
  (ADC_CHANNEL_3_SMP   | ADC_CHANNEL_3_BITFIELD),    /*!< ADC channel ADCx_IN3  */
  (ADC_CHANNEL_4_SMP   | ADC_CHANNEL_4_BITFIELD),    /*!< ADC channel ADCx_IN4  */
  (ADC_CHANNEL_5_SMP   | ADC_CHANNEL_5_BITFIELD),    /*!< ADC channel ADCx_IN5  */
  (ADC_CHANNEL_6_SMP   | ADC_CHANNEL_6_BITFIELD),    /*!< ADC channel ADCx_IN6  */
  (ADC_CHANNEL_7_SMP   | ADC_CHANNEL_7_BITFIELD),    /*!< ADC channel ADCx_IN7  */
  (ADC_CHANNEL_8_SMP   | ADC_CHANNEL_8_BITFIELD),    /*!< ADC channel ADCx_IN9  */
  (ADC_CHANNEL_9_SMP   | ADC_CHANNEL_9_BITFIELD),    /*!< ADC channel ADCx_IN8  */
  (ADC_CHANNEL_10_SMP  | ADC_CHANNEL_10_BITFIELD),   /*!< ADC channel ADCx_IN10 */
  (ADC_CHANNEL_11_SMP  | ADC_CHANNEL_11_BITFIELD),   /*!< ADC channel ADCx_IN11 */
  (ADC_CHANNEL_12_SMP  | ADC_CHANNEL_12_BITFIELD),   /*!< ADC channel ADCx_IN12 */
  (ADC_CHANNEL_13_SMP  | ADC_CHANNEL_13_BITFIELD),   /*!< ADC channel ADCx_IN13 */
  (ADC_CHANNEL_14_SMP  | ADC_CHANNEL_14_BITFIELD),   /*!< ADC channel ADCx_IN14 */
  (ADC_CHANNEL_15_SMP  | ADC_CHANNEL_15_BITFIELD),   /*!< ADC channel ADCx_IN15 */
  (ADC_CHANNEL_16_SMP  | ADC_CHANNEL_16_BITFIELD),   /*!< ADC channel ADCx_IN16 */
  (ADC_CHANNEL_17_SMP  | ADC_CHANNEL_17_BITFIELD),   /*!< ADC channel ADCx_IN17 */
  (ADC_CHANNEL_18_SMP  | ADC_CHANNEL_18_BITFIELD),   /*!< ADC channel ADCx_IN18 */
};


/* Internal mask for ADC analog watchdog:                                     */
/* To select into literals LL_ADC_AWD_CHANNELx_xxx the relevant bits for:     */
/* (concatenation of multiple bits used in different analog watchdogs,        */
/* (feature of several watchdogs not available on all STM32 series)).       */
/* - analog watchdog 1: monitored channel defined by number,                  */
/*   selection of ADC group (ADC groups regular and-or injected).             */
/* - analog watchdog 2 and 3: monitored channel defined by bitfield, no       */
/*   selection on groups.                                                     */

/* Definition of channels ID number information to be inserted into           */
/* analog watchdog channels literals definition.                              */
#define ADC_CHANNEL_0_NUMBER               (0x00000000UL)
#define ADC_CHANNEL_1_NUMBER               (ADC_CFGR1_AWD1CH_0)
#define ADC_CHANNEL_2_NUMBER               (ADC_CFGR1_AWD1CH_1)
#define ADC_CHANNEL_3_NUMBER               (ADC_CFGR1_AWD1CH_1 | ADC_CFGR1_AWD1CH_0)
#define ADC_CHANNEL_4_NUMBER               (ADC_CFGR1_AWD1CH_2)
#define ADC_CHANNEL_5_NUMBER               (ADC_CFGR1_AWD1CH_2 | ADC_CFGR1_AWD1CH_0)
#define ADC_CHANNEL_6_NUMBER               (ADC_CFGR1_AWD1CH_2 | ADC_CFGR1_AWD1CH_1)
#define ADC_CHANNEL_7_NUMBER               (ADC_CFGR1_AWD1CH_2 | ADC_CFGR1_AWD1CH_1 | ADC_CFGR1_AWD1CH_0)
#define ADC_CHANNEL_8_NUMBER               (ADC_CFGR1_AWD1CH_3)
#define ADC_CHANNEL_9_NUMBER               (ADC_CFGR1_AWD1CH_3 | ADC_CFGR1_AWD1CH_0)
#define ADC_CHANNEL_10_NUMBER              (ADC_CFGR1_AWD1CH_3 | ADC_CFGR1_AWD1CH_1)
#define ADC_CHANNEL_11_NUMBER              (ADC_CFGR1_AWD1CH_3 | ADC_CFGR1_AWD1CH_1 | ADC_CFGR1_AWD1CH_0)
#define ADC_CHANNEL_12_NUMBER              (ADC_CFGR1_AWD1CH_3 | ADC_CFGR1_AWD1CH_2)
#define ADC_CHANNEL_13_NUMBER              (ADC_CFGR1_AWD1CH_3 | ADC_CFGR1_AWD1CH_2 | ADC_CFGR1_AWD1CH_0)
#define ADC_CHANNEL_14_NUMBER              (ADC_CFGR1_AWD1CH_3 | ADC_CFGR1_AWD1CH_2 | ADC_CFGR1_AWD1CH_1)
#define ADC_CHANNEL_15_NUMBER              (ADC_CFGR1_AWD1CH_3 | ADC_CFGR1_AWD1CH_2 | \
                                            ADC_CFGR1_AWD1CH_1 | ADC_CFGR1_AWD1CH_0)
#define ADC_CHANNEL_16_NUMBER              (ADC_CFGR1_AWD1CH_4)
#define ADC_CHANNEL_17_NUMBER              (ADC_CFGR1_AWD1CH_4 | ADC_CFGR1_AWD1CH_0)
#define ADC_CHANNEL_18_NUMBER              (ADC_CFGR1_AWD1CH_4 | ADC_CFGR1_AWD1CH_1)
#define ADC_CHANNEL_19_NUMBER              (ADC_CFGR1_AWD1CH_4 | ADC_CFGR1_AWD1CH_1 | ADC_CFGR1_AWD1CH_0)

