stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_adc.h
/** @defgroup ADC_LL_EC_OFFSET_NB  ADC instance - Offset instance
  * @{
  */
#define LL_ADC_OFFSET_1                    ADC_OFR1_REGOFFSET /*!< ADC offset instance 1: ADC channel and offset level
to which the offset programmed will be applied (independently of channel mapped on ADC group regular or injected) */
#define LL_ADC_OFFSET_2                    ADC_OFR2_REGOFFSET /*!< ADC offset instance 2: ADC channel and offset level
to which the offset programmed will be applied (independently of channel mapped on ADC group regular or injected) */
#define LL_ADC_OFFSET_3                    ADC_OFR3_REGOFFSET /*!< ADC offset instance 3: ADC channel and offset level
to which the offset programmed will be applied (independently of channel mapped on ADC group regular or injected) */
#define LL_ADC_OFFSET_4                    ADC_OFR4_REGOFFSET /*!< ADC offset instance 4: ADC channel and offset level
to which the offset programmed will be applied (independently of channel mapped on ADC group regular or injected) */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OFFSET_SIGNED_SATURATION ADC instance - Offset signed saturation mode
  * @{
  */
#define LL_ADC_OFFSET_SIGNED_SAT_DISABLE   (0x00000000UL)     /*!< ADC offset signed saturation is disabled */
#define LL_ADC_OFFSET_SIGNED_SAT_ENABLE    (ADC_OFCFGR1_SSAT) /*!< ADC offset signed saturation is enabled */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OFFSET_UNSIGNED_SATURATION ADC instance - Offset unsigned saturation mode
  * @{
  */
#define LL_ADC_OFFSET_UNSIGNED_SAT_DISABLE   (0x00000000UL)     /*!< ADC offset unsigned saturation is disabled */
#define LL_ADC_OFFSET_UNSIGNED_SAT_ENABLE    (ADC_OFCFGR1_USAT) /*!< ADC offset unsigned saturation is enabled */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OFFSET_SIGN ADC instance - Offset sign
  * @{
  */
#define LL_ADC_OFFSET_SIGN_NEGATIVE        (0x00000000UL)       /*!< ADC offset is negative */
#define LL_ADC_OFFSET_SIGN_POSITIVE        (ADC_OFCFGR1_POSOFF) /*!< ADC offset is positive */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_GROUPS  ADC instance - Groups
  * @{
  */
#define LL_ADC_GROUP_REGULAR               (0x00000001UL)     /*!< ADC group regular (available on all STM32 devices) */
#define LL_ADC_GROUP_INJECTED              (0x00000002UL)     /*!< ADC group injected (not available on all STM32
                                                                   devices)*/
#define LL_ADC_GROUP_REGULAR_INJECTED      (0x00000003UL)     /*!< ADC both groups regular and injected */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_CHANNEL  ADC instance - Channel number
  * @{
  */
#define LL_ADC_CHANNEL_0            ( 0UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN0  */
#define LL_ADC_CHANNEL_1            ( 1UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN1  */
#define LL_ADC_CHANNEL_2            ( 2UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN2  */
#define LL_ADC_CHANNEL_3            ( 3UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN3  */
#define LL_ADC_CHANNEL_4            ( 4UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN4  */
#define LL_ADC_CHANNEL_5            ( 5UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN5  */
#define LL_ADC_CHANNEL_6            ( 6UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN6  */
#define LL_ADC_CHANNEL_7            ( 7UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN7  */
#define LL_ADC_CHANNEL_8            ( 8UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN8  */
#define LL_ADC_CHANNEL_9            ( 9UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN9  */
#define LL_ADC_CHANNEL_10           (10UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN10 */
#define LL_ADC_CHANNEL_11           (11UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN11 */
#define LL_ADC_CHANNEL_12           (12UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN12 */
#define LL_ADC_CHANNEL_13           (13UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN13 */
#define LL_ADC_CHANNEL_14           (14UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN14 */
#define LL_ADC_CHANNEL_15           (15UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN15 */
#define LL_ADC_CHANNEL_16           (16UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN16 */
#define LL_ADC_CHANNEL_17           (17UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN17 */
#define LL_ADC_CHANNEL_18           (18UL | ADC_CHANNEL_EXTERNAL | LL_ADC_PATH_INTERNAL_NONE)  /*!< Channel ADCx_IN18 */
#define LL_ADC_CHANNEL_VREFINT      (0UL \
                                     | ADC_CHANNEL_INTERNAL_ADC1 | ADC_CHANNEL_INTERNAL_ADC2 \
                                     | LL_ADC_PATH_INTERNAL_VREFINT)                           /*!< ADC internal channel
                                     connected to VrefInt: Internal voltage reference. */
#define LL_ADC_CHANNEL_DAC1CH1_ADC2 (14UL \
                                     | ADC_CHANNEL_INTERNAL_ADC2)                              /*!< ADC internal channel
                                     DAC1 channel 1, channel specific to ADC2 */
#define LL_ADC_CHANNEL_DAC1CH2_ADC2 (15UL \
                                     | ADC_CHANNEL_INTERNAL_ADC2)                              /*!< ADC internal channel
                                     DAC1 channel 2, channel specific to ADC2 */
#define LL_ADC_CHANNEL_VBAT         (16UL \
                                     | ADC_CHANNEL_INTERNAL_ADC1 | ADC_CHANNEL_INTERNAL_ADC2 \
                                     | LL_ADC_PATH_INTERNAL_VBAT)                              /*!< ADC internal channel
                                     connected to Vbat/4: Vbat voltage through a divider ladder of factor 1/4 to have
                                     Vbat always below Vdda. */
#define LL_ADC_CHANNEL_TEMPSENSOR   (17UL \
                                     | ADC_CHANNEL_INTERNAL_ADC1 | ADC_CHANNEL_INTERNAL_ADC2 \
                                     | LL_ADC_PATH_INTERNAL_TEMPSENSOR)                        /*!< ADC internal channel
                                     Temperature sensor */
#define LL_ADC_CHANNEL_VDDCORE      (18UL \
                                     | ADC_CHANNEL_INTERNAL_ADC1 | ADC_CHANNEL_INTERNAL_ADC2 \
                                     | LL_ADC_PATH_INTERNAL_VDDCORE)                           /*!< ADC internal channel
                                     Vddcore */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_TRIGGER_SOURCE  ADC group regular - Trigger source
  * @{
  */
#define LL_ADC_REG_TRIG_SOFTWARE           (0x00000000UL)                                         /*!< ADC group regular
                                           conversion trigger internal: SW start. */
#define LL_ADC_REG_TRIG_EXT_TIM1_CH1       (ADC_REG_TRIG_EXT_EDGE_DEFAULT) /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM1 channel 1 event
                                           (capture compare: input capture or output capture).
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_TIM1_CH2       (ADC_CFGR1_EXTSEL_0 | ADC_REG_TRIG_EXT_EDGE_DEFAULT)   /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM1 channel 2 event
                                           (capture compare: input capture or output capture).
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_TIM1_CH3       (ADC_CFGR1_EXTSEL_1 | ADC_REG_TRIG_EXT_EDGE_DEFAULT)   /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM1 channel 3 event
                                           (capture compare: input capture or output capture).
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_TIM2_CH2       (ADC_CFGR1_EXTSEL_1 | ADC_CFGR1_EXTSEL_0 \
                                            | ADC_REG_TRIG_EXT_EDGE_DEFAULT)                      /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM2 channel 2 event
                                           (capture compare: input capture or output capture).
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_TIM3_TRGO      (ADC_CFGR1_EXTSEL_2 | ADC_REG_TRIG_EXT_EDGE_DEFAULT)   /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM3 TRGO event.
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_TIM4_CH4       (ADC_CFGR1_EXTSEL_2 | ADC_CFGR1_EXTSEL_0 \
                                            | ADC_REG_TRIG_EXT_EDGE_DEFAULT)                      /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM4 channel 4 event
                                           (capture compare: input capture or output capture).
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_EXTI_LINE11    (ADC_CFGR1_EXTSEL_2 | ADC_CFGR1_EXTSEL_1 \
                                            | ADC_REG_TRIG_EXT_EDGE_DEFAULT)                      /*!< ADC group regular
                                           conversion trigger from external periph.: external interrupt line 11 event.
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_TIM1_TRGO      (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_0 \
                                            | ADC_REG_TRIG_EXT_EDGE_DEFAULT)                      /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM1 TRGO event.
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_TIM1_TRGO2     (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_1 \
                                            | ADC_REG_TRIG_EXT_EDGE_DEFAULT)                      /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM1 TRGO2 event.
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_TIM2_TRGO      (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_1 \
                                            | ADC_CFGR1_EXTSEL_0 | ADC_REG_TRIG_EXT_EDGE_DEFAULT) /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM2 TRGO event.
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_TIM4_TRGO      (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_2 \
                                            | ADC_REG_TRIG_EXT_EDGE_DEFAULT)                      /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM4 TRGO event.
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_TIM6_TRGO      (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_2 \
                                            | ADC_CFGR1_EXTSEL_0 | ADC_REG_TRIG_EXT_EDGE_DEFAULT) /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM6 TRGO event.
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_TIM15_TRGO     (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_2 \
                                            | ADC_CFGR1_EXTSEL_1 | ADC_REG_TRIG_EXT_EDGE_DEFAULT) /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM15 TRGO event.
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_TIM3_CH4       (ADC_CFGR1_EXTSEL_3 | ADC_CFGR1_EXTSEL_2 \
                                            | ADC_CFGR1_EXTSEL_1 | ADC_CFGR1_EXTSEL_0 \
                                            | ADC_REG_TRIG_EXT_EDGE_DEFAULT) /*!< ADC group regular
                                           conversion trigger from external peripheral: TIM3 channel 4 event
                                           (capture compare: input capture or output capture).
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_EXTI_LINE15    (ADC_CFGR1_EXTSEL_4 | ADC_REG_TRIG_EXT_EDGE_DEFAULT)   /*!< ADC group regular
                                           conversion trigger from external periph.: external interrupt line 15 event.
                                           Trigger edge set to rising edge (default setting). */
#define LL_ADC_REG_TRIG_EXT_LPTIM1_CH1     (ADC_CFGR1_EXTSEL_4 | ADC_CFGR1_EXTSEL_1 \
                                            | ADC_REG_TRIG_EXT_EDGE_DEFAULT)                      /*!< ADC group regular
                                           conversion trigger from external peripheral: LPTIM1 channel 1 event (capture
                                           compare: input capture or output capture). Trigger edge set to rising edge
                                           (default setting). */
#define LL_ADC_REG_TRIG_EXT_LPTIM2_CH1     (ADC_CFGR1_EXTSEL_4 | ADC_CFGR1_EXTSEL_1 \
                                            | ADC_CFGR1_EXTSEL_0 | ADC_REG_TRIG_EXT_EDGE_DEFAULT) /*!< ADC group regular
                                           conversion trigger from external peripheral: LPTIM2 channel 1 event (capture
                                           compare: input capture or output capture). Trigger edge set to rising edge
                                           (default setting). */
#define LL_ADC_REG_TRIG_EXT_LPTIM3_CH1     (ADC_CFGR1_EXTSEL_4 | ADC_CFGR1_EXTSEL_2 \
                                            | ADC_REG_TRIG_EXT_EDGE_DEFAULT)                      /*!< ADC group regular
                                           conversion trigger from external peripheral: LPTIM3 channel 1 event (capture
                                           compare: input capture or output capture). Trigger edge set to rising edge
                                           (default setting). */
#define LL_ADC_REG_TRIG_EXT_LPTIM4_OUT     (ADC_CFGR1_EXTSEL_4 | ADC_CFGR1_EXTSEL_2 \
                                            | ADC_CFGR1_EXTSEL_0 | ADC_REG_TRIG_EXT_EDGE_DEFAULT) /*!< ADC group regular
                                           conversion trigger from external peripheral: LPTIM4 OUT event.
                                           Trigger edge set to rising edge (default setting). */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_TRIGGER_EDGE  ADC group regular - Trigger edge
  * @{
  */
#define LL_ADC_REG_TRIG_EXT_RISING         (ADC_CFGR1_EXTEN_0)                     /*!< ADC group regular conversion
                                           trigger polarity set to rising edge */
#define LL_ADC_REG_TRIG_EXT_FALLING        (ADC_CFGR1_EXTEN_1)                     /*!< ADC group regular conversion
                                           trigger polarity set to falling edge */
#define LL_ADC_REG_TRIG_EXT_RISINGFALLING  (ADC_CFGR1_EXTEN_1 | ADC_CFGR1_EXTEN_0) /*!< ADC group regular conversion
                                           trigger polarity set to both rising and falling edges */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_SAMPLING_MODE  ADC group regular - Sampling mode
  * @{
  */
#define LL_ADC_REG_SAMPLING_MODE_NORMAL    (0x00000000UL)     /*!< ADC conversions sampling phase duration
                                           is defined using  @ref ADC_LL_EC_CHANNEL_SAMPLINGTIME. */
#define LL_ADC_REG_SAMPLING_MODE_BULB      (ADC_CFGR2_BULB)   /*!< ADC conversions sampling phase starts immediately
                                           after end of conversion, and stops upon trigger event.
                                           Note: First conversion is using minimal sampling time
                                           (see @ref ADC_LL_EC_CHANNEL_SAMPLINGTIME). */
#define LL_ADC_REG_SAMPLING_MODE_TRIGGER_CONTROLED  (ADC_CFGR2_SMPTRIG)/*!< ADC conversions sampling phase is controlled
                                           by trigger events: Trigger rising edge  = start sampling,
                                           Trigger falling edge = stop sampling and start conversion. */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_CONTINUOUS_MODE  ADC group regular - Continuous mode
  * @{
  */
#define LL_ADC_REG_CONV_SINGLE             (0x00000000UL)     /*!< ADC conversions performed in single mode:
                                           one conversion per trigger */
#define LL_ADC_REG_CONV_CONTINUOUS         (ADC_CFGR1_CONT)   /*!< ADC conversions performed in continuous mode:
                                           after the first trigger, following conversions launched successively
                                           automatically */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_DATA_TRANSFER  ADC group regular - Data transfer mode of ADC conversion data
  * @{
  */
#define LL_ADC_REG_DR_TRANSFER             (0x00000000UL)       /*!< ADC conversions data are available
                                           in ADC data register only */
#define LL_ADC_REG_DMA_TRANSFER_LIMITED    (ADC_CFGR1_DMNGT_0)  /*!< ADC conversion data are transferred by DMA,
                                           in limited mode (one shot mode): DMA transfer requests are stopped when
                                           number of DMA data transfers (number of ADC conversions) is reached.
                                           This ADC mode is intended to be used with DMA mode non-circular. */
#define LL_ADC_REG_DMA_TRANSFER_UNLIMITED  (ADC_CFGR1_DMNGT_1 \
                                            | ADC_CFGR1_DMNGT_0) /*!< ADC conversion data are transferred by DMA,
                                           in unlimited mode: DMA transfer requests are unlimited, whatever
                                           number of DMA data transferred (number of ADC conversions).
                                           This ADC mode is intended to be used with DMA mode circular. */
#define LL_ADC_REG_MDF_TRANSFER            (ADC_CFGR1_DMNGT_1)  /*!< ADC conversion data are transferred to MDF */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_OVR_DATA_BEHAVIOR  ADC group regular - Overrun behavior on conversion data
  * @{
  */
#define LL_ADC_REG_OVR_DATA_PRESERVED      (0x00000000UL)     /*!< ADC group regular behavior in case of overrun:
                                                                   data preserved */
#define LL_ADC_REG_OVR_DATA_OVERWRITTEN    (ADC_CFGR1_OVRMOD) /*!< ADC group regular behavior in case of overrun:
                                                                   data overwritten */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_SEQ_SCAN_LENGTH  ADC group regular - Sequencer scan length
  * @{
  */
#define LL_ADC_REG_SEQ_SCAN_DISABLE        (0x00000000UL)                 /*!< ADC group regular sequencer disable
                                           (equivalent to sequencer of 1 rank: ADC conversion on only 1 channel) */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_2RANKS  (ADC_SQR1_L_0)                 /*!< ADC group regular sequencer enable
                                           with 2 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_3RANKS  (ADC_SQR1_L_1)                 /*!< ADC group regular sequencer enable
                                           with 3 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS  (ADC_SQR1_L_1 | ADC_SQR1_L_0)  /*!< ADC group regular sequencer enable
                                           with 4 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_5RANKS  (ADC_SQR1_L_2)                 /*!< ADC group regular sequencer enable
                                           with 5 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_6RANKS  (ADC_SQR1_L_2 | ADC_SQR1_L_0)  /*!< ADC group regular sequencer enable
                                           with 6 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_7RANKS  (ADC_SQR1_L_2 | ADC_SQR1_L_1) /*!< ADC group regular sequencer enable
                                           with 7 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_8RANKS  (ADC_SQR1_L_2 | ADC_SQR1_L_1 \
                                            | ADC_SQR1_L_0)                /*!< ADC group regular sequencer enable
                                           with 8 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_9RANKS  (ADC_SQR1_L_3)                 /*!< ADC group regular sequencer enable
                                           with 9 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_10RANKS (ADC_SQR1_L_3 | ADC_SQR1_L_0)  /*!< ADC group regular sequencer enable
                                           with 10 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_11RANKS (ADC_SQR1_L_3 | ADC_SQR1_L_1)  /*!< ADC group regular sequencer enable
                                           with 11 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_12RANKS (ADC_SQR1_L_3 | ADC_SQR1_L_1 \
                                            | ADC_SQR1_L_0)                /*!< ADC group regular sequencer enable
                                           with 12 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_13RANKS (ADC_SQR1_L_3 | ADC_SQR1_L_2)  /*!< ADC group regular sequencer enable
                                           with 13 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_14RANKS (ADC_SQR1_L_3 | ADC_SQR1_L_2 \
                                            | ADC_SQR1_L_0)                /*!< ADC group regular sequencer enable
                                           with 14 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_15RANKS (ADC_SQR1_L_3 | ADC_SQR1_L_2 \
                                            | ADC_SQR1_L_1)                /*!< ADC group regular sequencerenable
                                           with 15 ranks in the sequence */
#define LL_ADC_REG_SEQ_SCAN_ENABLE_16RANKS (ADC_SQR1_L_3 | ADC_SQR1_L_2 \
                                            | ADC_SQR1_L_1 | ADC_SQR1_L_0) /*!< ADC group regular sequencer enable
                                           with 16 ranks in the sequence */
/**
  * @}
  */

